In [62]:
import pandas as pd
df = pd.read_csv(r"precios_semanas_20200419.csv", sep=",", encoding="Latin-1")
df.head(7)

   precio          sucursal_id producto_id
0   29.90              2-1-184        2288
1   39.90              2-1-206        2288
2  499.99              9-1-430      205870
3  539.99              9-2-107      205870
4  539.99  5218-03-09 00:00:00      205870
5  589.99              9-1-430      205894
6  189.99              9-1-430      205955

In [63]:
#Verificación de datos faltantes
contador=df.isnull().sum()
contador

precio         1807
sucursal_id       0
producto_id       0
dtype: int64

In [64]:
#rellena los datos nulos, en base al valor de la siguiente fila.
df=df.fillna(method="bfill")

In [65]:
#Verificación de datos faltantes
contador=df.isnull().sum()
contador

precio         0
sucursal_id    0
producto_id    0
dtype: int64

In [66]:
#transformando: eliminando los 00:00:00
df['sucursal_id'] = df['sucursal_id'].apply(lambda x: x.split(' ')[0])

In [67]:
df.head(5)

   precio sucursal_id producto_id
0   29.90     2-1-184        2288
1   39.90     2-1-206        2288
2  499.99     9-1-430      205870
3  539.99     9-2-107      205870
4  539.99  5218-03-09      205870

In [68]:
df.dtypes

precio         float64
sucursal_id     object
producto_id     object
dtype: object

In [69]:
def normalizar_producto_id(id):
    if (type(id)!=str):
        return id
    cantidad_caracter = len(id)
    if (len(id) < 13):
        id = '0'*(13-cantidad_caracter)+id
    return id

In [70]:
df['producto_id'] = df['producto_id'].apply(normalizar_producto_id)

In [71]:
df.head()

   precio sucursal_id    producto_id
0   29.90     2-1-184  0000000002288
1   39.90     2-1-206  0000000002288
2  499.99     9-1-430  0000000205870
3  539.99     9-2-107  0000000205870
4  539.99  5218-03-09  0000000205870

In [72]:
#cambiamos de "." a ","
for i, elemento in enumerate(df['precio']):
   df['precio'][i] = str(df['precio'][i])
   #Transformaciones en los campos numéricos
for i, elemento in enumerate(df['precio']):
   elemento = elemento.replace('.', ',')
   df['precio'][i] = elemento

C:\Users\HP SUPPORT\AppData\Local\Temp\ipykernel_1860\219681451.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['precio'][i] = str(df['precio'][i])

In [73]:
df.head()

   precio sucursal_id    producto_id
0    29,9     2-1-184  0000000002288
1    39,9     2-1-206  0000000002288
2  499,99     9-1-430  0000000205870
3  539,99     9-2-107  0000000205870
4  539,99  5218-03-09  0000000205870

In [74]:
df.to_csv('precios_semanas_20200419_ok.csv', index=False)